cce.org
# -*- mode: org -*-
# -*- coding: utf-8 -*-

#+TITLE:      CCE
#+AUTHOR:      Kevin Caye

#+PROPERTY: header-args    :mkdirp yes

My inspirations come from: 
- [[https://github.com/IvanMalison/dotfiles][IvanMalison/dotfiles]]
- [[http://doc.rix.si/cce/cce.html][Complete Computing Environment]]
- [[http://pages.sachachua.com/.emacs.d/Sacha.html][Sacha Chua's Emacs configuration]]
- [[http://doc.norang.ca/org-mode.html][Org Mode - Organize Your Life In Plain Text!]]
- [[https://emacs.cafe/emacs/orgmode/gtd/2017/06/30/orgmode-gtd.html][Orgmode for GTD]]
- [[https://www.scottharney.com/using-ansible-to-bootstap-my-work-environment_part_1/][Using Ansible to Bootstrap My Work Environment]]

* Installation and Usage
** requirements
#+BEGIN_SRC yaml :tangle requirements.yml
---
- name: geerlingguy.docker
  version: 2.5.2
#+END_SRC
** inventory
Create a ./inventory.yml file: 
#+BEGIN_SRC yaml :tangle inventory_dist.yml
all:
  hosts:
    localhost
  vars:
    ansible_connection: local
    ansible_sudo_pass: ""
#+END_SRC

You can encrypt this file with 
#+BEGIN_SRC shell
ansible-vault create inventory.yml
#+END_SRC
** Variables
Create variables
#+BEGIN_SRC yaml :tangle group_vars/all_dist.yml
###
### Complete Computing Environment Features
###
# Set these options to true or false to toggle specific features

docker_enabled: true
emacs_enabled: true
org_enabled: true
r_enabled: true
python_enabled: true
tmux_enabled: true
zsh_enabled: true
remote_enabled: true
write_enable: false

###
### General
###
# Sets your username
username: "cayek"
pyvenv_path: "/home/{{username}}/.pyvenv"
extra_bin_path: "/home/{{username}}/.bin"
extra_zshcompletion_path: "/home/{{username}}/.zsh-completions"

###
### mail
###
# Sets your username
name: ""
primary_mail: ""
other_email: ""

###
### ssh
###
home_hostname: ""
git_username: ""
box_hostname: ""
box_username: ""
git_hostname: ""
git_username: ""

###
### secrets
###
secret_url: ""
secret_key: ""
pass_repo: ""

###
### emacs
###

spacemacs_dotdirectory: "/home/{{username}}/.spacemacs.d"
spacemacs_repo: "git@github.com:cayek/spacemacs.git"

###
### Docker
###
# Where you want Docker to store images
docker_image_directory: "{{ docker_home }}/data"

# Where you want Docker to store its container data.
docker_home: /mnt/docker

# Docker storage driver, see https://docs.docker.com/storage/storagedriver/select-storage-driver/#supported-backing-filesystems
# You might want to change this to ZFS, depending on your underlying filesystem.
docker_storage_driver: overlay2

###
### tmux
tmux_autostart: false

###
### inspiration
###
inspiration_enabled: True
#+END_SRC

Create file:./group_vars/all.yml and edit it.
#+BEGIN_SRC shell
cp ./group_vars/all_dist.yml ./group_vars/all.yml
#+END_SRC

** Main yaml Tasks file

#+NAME: code_cce
#+BEGIN_SRC yaml :tangle cce.yml
  ---
  - hosts: all

    pre_tasks:
      - import_tasks: tasks/users.yml
        tags: users

    roles:
      - role: geerlingguy.docker
        tags:
          - docker
          - skip_ansible_lint
        become: yes
        when: (docker_enabled | default(False))

    tasks:
    - import_tasks: tasks/core.yml
      tags: core

    - import_tasks: tasks/secret.yml
      when: (secret_enabled | default(False))
      tags: secret

    - import_tasks: tasks/docker.yml
      when: (docker_enabled | default(False))
      tags: docker

    - import_tasks: tasks/emacs.yml
      when: (emacs_enabled | default(False))
      tags: emacs

    - import_tasks: tasks/mail.yml
      when: (mail_enabled | default(False))
      tags: mail



    - import_tasks: tasks/emacs_stable.yml
      when: (stable_enabled | default(False))
      tags: emacsstable

    - import_tasks: tasks/web.yml
      tags: web

    - import_tasks: tasks/org.yml
      when: (org_enabled | default(False))
      tags: org

    - import_tasks: tasks/r.yml
      when: (r_enabled | default(False))
      tags: r

    - import_tasks: tasks/python.yml
      when: (python_enabled | default(False))
      tags: python

    - import_tasks: tasks/bib.yml
      when: (bib_enabled | default(False))
      tags: bib


    - import_tasks: tasks/zsh.yml
      when: (zsh_enabled | default(False))
      tags: zsh

    - import_tasks: tasks/tmux.yml
      when: (tmux_enabled | default(False))
      tags: tmux

    - import_tasks: tasks/write.yml
      when: (write_enabled | default(False))
      tags: write

    - import_tasks: tasks/inspiration.yml
      when: (inspiration_enabled | default(False))
      tags: inspiration

    - import_tasks: tasks/remote.yml
      when: (remote_enabled | default(False))
      tags: remote


#+END_SRC

** run all 
Run the playbook with: 
#+BEGIN_SRC shell :tangle cce.sh
#!/bin/bash
test -f /usr/bin/apt && sudo apt install ansible

make all
#+END_SRC
* Users
#+BEGIN_SRC yaml :tangle tasks/users.yml 
---
- name: Create user group
  group:
    name: "{{ username }}"
    state: present
  become: yes

- name: Create user
  user:
    name: "{{ username }}"
    state: present
    group: "{{ username }}"
  become: yes

- name: Create extra bin path
  file:
    path: '{{extra_bin_path}}'
    group: "{{username}}"
    owner: "{{username}}"
    state: directory
  become: yes

- name: add {{extra_bin_path}} to path
  lineinfile: 
    dest: "/home/{{username}}/.zshenv"
    state: present
    regexp: 'export PATH=(["]*)((?!.*?{{extra_bin_path}}).*?):\$PATH(["]*)$'
    line: export PATH=\1\2:{{extra_bin_path}}:$PATH\3
    backrefs: yes
    create: yes
    firstmatch: yes
  when: (zsh_enabled | default(False))

- name: Create extra zsh completion folder
  file:
    path: '{{extra_zshcompletion_path}}'
    group: "{{username}}"
    owner: "{{username}}"
    state: directory
  become: yes

# - name: add zsh extra tab competition capabilites
#   blockinfile: 
#     dest: "/home/{{username}}/.zshrc"
#     insertafter: EOF
#     block: |
#       # folder of all of your autocomplete functions
#       fpath=({{extra_zshcompletion_path}} $fpath)
      
#       # enable autocomplete function
#       autoload -U compinit
#       compinit
#   when: (zsh_enabled | default(False))

- name: create projects folder
  file:
    path: "/home/{{username}}/projects/"
    state: directory
    recurse: yes
#+END_SRC
* Core
#+BEGIN_SRC yaml :tangle tasks/core.yml 
  ---
  - name: install core packages
    apt:
      name: ['zsh', 'ispell', 'aspell-fr', 'pass', 'vim', 'git', 'make', 'msmtp', 'isync', 'htop', 'curl', 
      'tmux', 'silversearcher-ag', 'ctags', 'unison', 'virtualenv', "python3-notmuch"]
      state: latest
      install_recommends: yes
      update_cache: yes
    become: yes

  - name: install python core packages
    apt:
      name: ['python3', 'python3-pip', 'python3-virtualenv', 'python-pip']
      state: latest
      install_recommends: yes
      update_cache: yes
    become: yes

  - name: Install python tools in .pyvenv 
    pip: 
      virtualenv_python: python3.6
      virtualenv: "{{pyvenv_path}}"
      virtualenv_site_packages: yes
      name: ['cookiecutter', 'mkdocs', 'dvc', 'academic', 'doit', 'afew']
      state: latest

  - name: Create symlink for python tools
    file: 
      src: '{{pyvenv_path}}/bin/{{ item }}'
      dest: '{{extra_bin_path}}/{{ item }}'
      state: link
    with_items:
      - cookiecutter
      - mkdocs
      - dvc
      - academic
      - doit
      - afew
#+END_SRC
* User secrets

*features*
- use tomb to keep secret files
- use pass to keep password

#+BEGIN_SRC yaml :tangle tasks/secret.yml 
## install tomb: https://www.dyne.org/software/tomb/
- name: Clone tomb
  git:
    repo: https://github.com/dyne/Tomb.git
    dest: ~/.src/Tomb
  become_user: "{{username}}"

- name: install packages dependencies for tomb
  apt:
    name: [gnupg, cryptsetup, pinentry-curses, steghide]
    state: present
    install_recommends: yes
    update_cache: yes
  become: yes

- name: Check if tomb is installed
  stat:
    path: /usr/local/bin/tomb
  register: tomb_path

- name: install tomb
  make:
    chdir: /home/{{username}}/.src/Tomb
    target: install
  become: yes
  when: tomb_path.stat.exists == false

- name: clone password store
  git:
    repo: "{{pass_repo}}"
    dest: "/home/{{username}}/.password-store"
#+END_SRC
* Graphics software
#+BEGIN_SRC yaml :tangle tasks/xsoft.yml 
- name: install graphic packages
  apt:
    name: ['okular', 'eog', 'unison-gtk']
    state: latest
    install_recommends: yes
    update_cache: yes
  become: yes
#+END_SRC
* emacs and spacemacs
** setup emacs and spacemacs
#+BEGIN_SRC yaml :tangle tasks/emacs.yml 
---
- name: add emacs repo
  apt_repository:
    repo: "ppa:kelleyk/emacs"
    state: present
  become: yes

- name: install emacs
  apt:
    name: ['emacs26']
    state: latest
    install_recommends: yes
    update_cache: yes
  become: yes

# - name: Clone spacemacs develop
#   git:
#     repo: "{{spacemacs_repo}}"
#     dest: ~/.emacs.d/
#     accept_hostkey: yes
#     version: develop
#     key_file: "/home/{{username}}/.ssh/id_rsa"

- name: Check if font is installed
  stat: path='/home/{{username}}/.fonts/SourceCodePro-Bold.otf'
  register: font_path

- name: Download font files
  get_url:
    url: https://github.com/adobe-fonts/source-code-pro/archive/2.030R-ro/1.050R-it.zip
    dest: /tmp/source-code-pro.zip 
  when: font_path.stat.exists == false
  become_user: "{{username}}"

- name: Extract font files
  unarchive:
    src: /tmp/source-code-pro.zip 
    dest: /tmp/
  when: font_path.stat.exists == false
  become_user: "{{username}}"

- name: Create font dir
  file:
    path: '/home/{{username}}/.fonts/'
    state: directory
  when: font_path.stat.exists == false
  become_user: "{{username}}"

- name: Copy font files 
  shell: cp -v /tmp/source-code-pro*/OTF/*.otf ~/.fonts/
  when: font_path.stat.exists == false
  become_user: "{{username}}"

- name: Update fc-cache
  shell: fc-cache -f
  when: font_path.stat.exists == false
  become_user: "{{username}}"

- name: Create spacemacs configuration directory 
  file:
    path: '{{spacemacs_dotdirectory}}'
    state: directory
  become_user: "{{username}}"

- name: Create spacemacs user configuration directory 
  file:
    path: '{{spacemacs_dotdirectory}}/userconf/'
    state: directory
  become_user: "{{username}}"
#+END_SRC
** spacemacs configuration file
Do not forget to load the file in your ~/.spacemacs: 
#+BEGIN_SRC emacs-lisp
(load-file "~/.spacemacs.d/spacemacs.el")

;; Do not write anything past this comment. This is where Emacs will
;; auto-generate custom variable definitions.
[...]
#+END_SRC

#+BEGIN_SRC yaml :tangle tasks/emacs.yml 
- name: spacemacs.el 
  template:
    src: emacs/spacemacs.el
    dest: "{{spacemacs_dotdirectory}}/spacemacs.el"
#+END_SRC
*** Spacemacs layers

Define my layers and additional packages

#+BEGIN_SRC elisp :tangle ./templates/emacs/spacemacs.el
(defun dotspacemacs/layers ()
  "Layer configuration:
This function should only modify configuration layer settings."
  (setq-default
   ;; Base distribution to use. This is a layer contained in the directory
   ;; `+distribution'. For now available distributions are `spacemacs-base'
   ;; or `spacemacs'. (default 'spacemacs)
   dotspacemacs-distribution 'spacemacs

   ;; Lazy installation of layers (i.e. layers are installed only when a file
   ;; with a supported type is opened). Possible values are `all', `unused'
   ;; and `nil'. `unused' will lazy install only unused layers (i.e. layers
   ;; not listed in variable `dotspacemacs-configuration-layers'), `all' will
   ;; lazy install any layer that support lazy installation even the layers
   ;; listed in `dotspacemacs-configuration-layers'. `nil' disable the lazy
   ;; installation feature and you have to explicitly list a layer in the
   ;; variable `dotspacemacs-configuration-layers' to install it.
   ;; (default 'unused)
   dotspacemacs-enable-lazy-installation 'unused

   ;; If non-nil then Spacemacs will ask for confirmation before installing
   ;; a layer lazily. (default t)
   dotspacemacs-ask-for-lazy-installation t

   ;; If non-nil layers with lazy install support are lazy installed.
   ;; List of additional paths where to look for configuration layers.
   ;; Paths must have a trailing slash (i.e. `~/.mycontribs/')
   dotspacemacs-configuration-layer-path '()

   ;; List of configuration layers to load.
   dotspacemacs-configuration-layers
   '(
     lsp
     epub
     w3m
     pdf
     ess
     bibtex
     ansible
     systemd
     pass
     csv
     docker
     emoji
     notmuch
     search-engine
     windows-scripts
     javascript
     yaml
     html
     (python :variables python-test-runner 'pytest
             python-backend 'lsp)
     helm
     (auto-completion :variables auto-completion-enable-help-tooltip 'manual
                      auto-completion-enable-snippets-in-popup t
                      )
     better-defaults
     emacs-lisp
     git
     (markdown :variables
               markdown-enable-math nil)
     multiple-cursors
     treemacs
     (org :variables
          org-enable-reveal-js-support t
          org-enable-github-support t)
     (shell :variables
            shell-default-height 30
            shell-default-position 'bottom)
     (spell-checking :variables spell-checking-enable-by-default nil)
     (syntax-checking :variables
                      syntax-checking-enable-by-default nil
                      syntax-checking-enable-tooltips nil)
     version-control
     restclient
     rust
     (elfeed :variables
             rmh-elfeed-org-files (list "~/box-cloud/feeds/feeds.org")
             elfeed-db-directory "~/box-cloud/feeds/.elfeed")
     )

   ;; List of additional packages that will be installed without being
   ;; wrapped in a layer. If you need some configuration for these
   ;; packages, then consider creating a layer. You can also put the
   ;; configuration in `dotspacemacs/user-config'.
   ;; To use a local version of a package, use the `:location' property:
   ;; '(your-package :location "~/path/to/your-package/")
   ;; Also include the dependencies as they will not be resolved automatically.
   dotspacemacs-additional-packages '(
                                      jupyter
                                      (ox-ipynb :location (recipe :fetcher github :repo "jkitchin/ox-ipynb"))
                                      (ox-hugo :location (recipe :fetcher github :repo "kaushalmodi/ox-hugo"))
                                      helm-org-rifle
                                      conda
                                      anki-editor
                                      eval-in-repl
                                      calfw
                                      calfw-ical
                                      ;; for R markdown
                                      ;; polymode
                                      ;; poly-R
                                      ;; poly-noweb
                                      ;; poly-markdown
                                      ;; learning
                                      pamparam
                                      org-noter
                                      anki-editor
                                      )

   ;; A list of packages that cannot be updated.
   dotspacemacs-frozen-packages '()

   ;; A list of packages that will not be installed and loaded.
   dotspacemacs-excluded-packages '(
                                    )

   ;; Defines the behaviour of Spacemacs when installing packages.
   ;; Possible values are `used-only', `used-but-keep-unused' and `all'.
   ;; `used-only' installs only explicitly used packages and deletes any unused
   ;; packages as well as their unused dependencies. `used-but-keep-unused'
   ;; installs only the used packages but won't delete unused ones. `all'
   ;; installs *all* packages supported by Spacemacs and never uninstalls them.
   ;; (default is `used-only')
   dotspacemacs-install-packages 'used-only))
#+END_SRC

