cce.org
*** Spacemacs user env
#+BEGIN_SRC elisp :tangle ./templates/emacs/spacemacs.el
(defun dotspacemacs/user-env ()
  "Environment variables setup.
This function defines the environment variables for your Emacs session. By
default it calls `spacemacs/load-spacemacs-env' which loads the environment
variables declared in `~/.spacemacs.env' or `~/.spacemacs.d/.spacemacs.env'.
See the header of this file for more information."
  (spacemacs/load-spacemacs-env))
#+END_SRC

*** Spacemacs user init
#+BEGIN_SRC elisp :tangle ./templates/emacs/spacemacs.el
(defun dotspacemacs/user-init ()
  "Initialization for user code:
This function is called immediately after `dotspacemacs/init', before layer
configuration.
It is mostly for variables that should be set before packages are loaded.
If you are unsure, try setting them in `dotspacemacs/user-config' first."
  )
#+END_SRC

*** Spacemacs user load
#+BEGIN_SRC elisp :tangle ./templates/emacs/spacemacs.el
(defun dotspacemacs/user-load ()
  "Library to load while dumping.
This function is called only while dumping Spacemacs configuration. You can
`require' or `load' the libraries of your choice that will be included in the
dump."
  )
#+END_SRC

*** Spacemacs user config
Where we load the rest of the config plus system specific variables.
#+BEGIN_SRC elisp :tangle ./templates/emacs/spacemacs.el
(defun dotspacemacs/user-config ()
  "Configuration for user code:
This function is called at the very end of Spacemacs startup, after layer
configuration.
Put your configuration code here, except for variables that should be set
before packages are loaded."

  (defun load-directory (dir)
    (let ((load-it (lambda (f)
                     (load-file (concat (file-name-as-directory dir) f)))
                   ))
      (mapc load-it (directory-files dir nil "\\.el$"))))
  (load-directory "{{spacemacs_dotdirectory}}/userconf/")
)
#+END_SRC

** base emacs configuration
#+BEGIN_SRC emacs-lisp :tangle ./templates/emacs/base.el
(require 'server)
(or (server-running-p)
    (server-start))

;; inline image size
(setq org-image-actual-width '(300))

;; google translate see: https://github.com/atykhonov/google-translate
(require 'google-translate)
(require 'google-translate-smooth-ui)
(global-set-key "\C-ct" 'google-translate-smooth-translate)

(setq google-translate-translation-directions-alist
      '(("en" . "fr") ("fr" . "en")))

;; flyspell default
(setq flyspell-default-dictionary "en_US")

(global-emojify-mode)
;; over write existing binding usin emoji
(spacemacs/set-leader-keys "ie" 'emojify-insert-emoji)
#+END_SRC

#+BEGIN_SRC yaml :tangle tasks/emacs.yml 
- name: spacemacs base.el 
  template:
    src: emacs/base.el
    dest: "{{spacemacs_dotdirectory}}/userconf/base.el"
#+END_SRC

* stable emacs and spacemacs
Because some time emacs develop is hard to follow :D
** ansible
#+BEGIN_SRC yaml :tangle tasks/emacs_stable.yml
- name: Create dir for stable emacs
  file:
    path: '/home/{{username}}/stable/'
    state: directory

- name: Clone spacemacs stable
  git:
    repo: "https://github.com/syl20bnr/spacemacs"
    dest: '/home/{{username}}/stable/.emacs.d/'
    version: master

- name: Create symlink
  file: 
    src: '/home/{{username}}/{{ item }}'
    dest: '/home/{{username}}/stable/{{ item }}'
    state: link
  with_items:
    - .fonts
#+END_SRC
* Web Browser
*Features*
- chromium browser
- w3m and spacemacs layers [[https://github.com/venmos/w3m-layer][venmos/w3m-layer]]
** ansible
#+BEGIN_SRC yaml :tangle tasks/web.yml 
- name: install web browser
  apt:
    name: ['chromium-browser', 'w3m']
    state: present
    install_recommends: yes
    update_cache: yes
  become: yes

- name: clone w3m layers
  git:
    repo: https://github.com/venmos/w3m-layer.git
    dest: "/home/{{username}}/.emacs.d/private/w3m"
  become_user: "{{username}}"

- name: spacemacs web.el 
  template:
    src: emacs/web.el
    dest: "{{spacemacs_dotdirectory}}/userconf/web.el"
#+END_SRC
** emacs
#+BEGIN_SRC emacs-lisp :tangle ./templates/emacs/web.el
(setq w3m-home-page "https://www.google.com")
;; W3M Home Page
(setq w3m-default-display-inline-images nil)
(setq w3m-default-toggle-inline-images nil)
;; W3M default display images
(setq w3m-command-arguments '("-cookie" "-F"))
(setq w3m-use-cookies t)
;; W3M use cookies
;; (setq browse-url-browser-function 'w3m-browse-url)
;; Browse url function use w3m
(setq w3m-view-this-url-new-session-in-background t)
;; W3M view url new session in background
#+END_SRC

#+RESULTS:
: t

* Orgmode
:LOGBOOK:
- Note taken on [2019-07-24 mer. 15:23] \\
  integrate new orgmode 9.2 [[https://orgmode.org/Changes.html][changes]]
:END:

*Feature*
- 
** ansible
#+BEGIN_SRC yaml :tangle tasks/org.yml 
- name: emacs org.el 
  template:
    src: emacs/org.el
    dest: "{{spacemacs_dotdirectory}}/userconf/org.el"
#+END_SRC

** General
#+BEGIN_SRC emacs-lisp :tangle ./templates/emacs/org.el
(require 'org)
(require 'org-protocol)

;; startup
(setq org-src-preserve-indentation t)
(setq org-startup-indented t)
(setq org-log-into-drawer t)
(setq org-startup-with-inline-images t)
(setq org-startup-folded t)
#+END_SRC
** refile
#+BEGIN_SRC emacs-lisp :tangle ./templates/emacs/org.el
(setq org-refile-targets `((nil :maxlevel . 2)
                           (org-agenda-files :maxlevel . 2)))
#+END_SRC

** Organization and agenda
*** Capture
#+BEGIN_SRC emacs-lisp :tangle ./templates/emacs/org.el
(setq org-directory "~/org/")
(setq org-default-notes-file "~/org/INBOX.org")

;; Capture templates for: TODO tasks, Notes, appointments, phone calls, meetings, and org-protocol
(setq org-capture-templates
      (quote (("t" "todo" entry (file "~/org/INBOX.org")
               "* TODO %?\n%U\n%a\n" :clock-in t :clock-resume t)
              ("r" "respond" entry (file "~/org/INBOX.org")
               "* NEXT Respond to %:from on %:subject\nSCHEDULED: %t\n%U\n%a\n" :clock-in t :clock-resume t :immediate-finish t)
              ("n" "note" entry (file "~/org/INBOX.org")
               "* %? :NOTE:\n%U\n%a\n" :clock-in t :clock-resume t)
              ("j" "Journal" entry (file+datetree "~/org/diary.org")
               "* %?\n%U\n" :clock-in t :clock-resume t)
              ("m" "Meeting" entry (file "~/org/INBOX.org")
               "* MEETING with %? :MEETING:\n%U" :clock-in t :clock-resume t)
              ("p" "Phone call" entry (file "~/org/INBOX.org")
               "* PHONE %? :PHONE:\n%U" :clock-in t :clock-resume t)
              )))

;; quick key binding
(global-set-key (kbd "<f4>") 'org-capture)
#+END_SRC
*** Tags and states definition
#+BEGIN_SRC emacs-lisp :tangle ./templates/emacs/org.el
;; Tags with fast selection keys
(setq org-tag-alist (quote ((:startgroup)
                            ;; who is the client/owner ?
                            ("@se" . ?s)
                            ("@kaizen" . ?k)
                            ("@home" . ?h)
                            (:endgroup)
                            )))

(setq org-todo-keywords
      (quote ((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d)")
              (sequence "WAITING(w@/!)" "HOLD(h@/!)" "|" "CANCELLED(c@/!)" "PHONE" "MEETING"))))

(setq org-todo-keyword-faces
      (quote (("TODO" :foreground "red" :weight bold)
              ("NEXT" :foreground "blue" :weight bold)
              ("DONE" :foreground "forest green" :weight bold)
              ("WAITING" :foreground "orange" :weight bold)
              ("HOLD" :foreground "magenta" :weight bold)
              ("CANCELLED" :foreground "forest green" :weight bold)
              ("MEETING" :foreground "forest green" :weight bold)
              ("PHONE" :foreground "forest green" :weight bold))))
#+END_SRC
*** Agenda file and view
#+BEGIN_SRC emacs-lisp :tangle ./templates/emacs/org.el
(setq org-agenda-files  '("~/org/INBOX.org"
                          "~/org/se.org"
                          "~/org/kaizen.org"
                          "~/org/probayes.org"
                          "~/org/home.org"
                          "~/mobile-org/inbox.org"
                          ))


;; custom agenda view
;; TODO

;; keybinding
(fset 'buffer_agenda_cmd
      "\C-ca<n")
(defun cayek:buffer_agenda_view ()
  (interactive)
  (execute-kbd-macro (symbol-function 'buffer_agenda_cmd))
  )

(fset 'agenda_cmd
      "\C-can")
(defun cayek:agenda_view ()
  (interactive)
  (execute-kbd-macro (symbol-function 'agenda_cmd))
  )


(global-set-key (kbd "<f9>") 'cayek:agenda_view)
(global-set-key (kbd "<f10>") 'cayek:buffer_agenda_view)
#+END_SRC

#+RESULTS:
: cayek:buffer_agenda_view

*** Clock setup
#+BEGIN_SRC emacs-lisp :tangle ./templates/emacs/org.el
;; Resume clocking task when emacs is restarted
(org-clock-persistence-insinuate)
;;
;; Show lot of clocking history so it's easy to pick items off the C-F11 list
(setq org-clock-history-length 23)
;; Resume clocking task on clock-in if the clock is open
(setq org-clock-in-resume t)
;; Separate drawers for clocking and logs
(setq org-drawers (quote ("PROPERTIES" "LOGBOOK")))
;; Save clock data and state changes and notes in the LOGBOOK drawer
(setq org-clock-into-drawer t)
;; Sometimes I change tasks I'm clocking quickly - this removes clocked tasks with 0:00 duration
(setq org-clock-out-remove-zero-time-clocks t)
;; Clock out when moving task to a done state
(setq org-clock-out-when-done t)
;; Save the running clock and all clock history when exiting Emacs, load it on startup
(setq org-clock-persist t)
;; Do not prompt to resume an active clock
(setq org-clock-persist-query-resume nil)
;; Enable auto clock resolution for finding open clocks
(setq org-clock-auto-clock-resolution (quote when-no-clock-is-running))
;; Include current clocking task in clock reports
(setq org-clock-report-include-clocking-task t)
#+END_SRC

#+RESULTS: elisp_org_clock
: t
*** Report Setup
#+BEGIN_SRC emacs-lisp :tangle ./templates/emacs/org.el
;; Agenda clock report parameters
(setq org-agenda-clockreport-parameter-plist
      (quote (:link t :maxlevel 1 :fileskip0 t :compact t :narrow 80)))
#+END_SRC

*** Archive
#+BEGIN_SRC emacs-lisp :tangle ./templates/emacs/org.el
(setq org-archive-location "~/org/archive/%s::")
#+END_SRC
