cce.org
** key binding
#+BEGIN_SRC emacs-lisp :tangle ./templates/emacs/org.el
(defun cayek:open_proj_inbox ()
  (interactive)
  (find-file-existing "~/org/INBOX.org")
  )

(defun cayek:open_cce()
  (interactive)
  (find-file-existing "~/projects/sysadmin/cce/cce.org")
  )

(defun cayek:open_diary()
  (interactive)
  (find-file-existing "~/org/diary.org")
  )

;; org files
(global-set-key (kbd "<f1>") 'cayek:open_proj_inbox)
(global-set-key (kbd "<f2>") 'cayek:open_diary)
(global-set-key (kbd "<f3>") 'cayek:open_cce)
#+END_SRC

#+RESULTS:
: cayek:open_cce

** Org babel
#+BEGIN_SRC emacs-lisp :tangle ./templates/emacs/org.el
(with-eval-after-load 'org
  (org-babel-do-load-languages
   'org-babel-load-languages
   '(
     (shell . t)
     (python . t)
     ;; (R . t)
     (dot . t)
     (org . t)
     (makefile . t)
     (emacs-lisp . t)
     ;; (http . t)
     ;; (jupyter . t)
     ))
  )
#+END_SRC
** org-rifle
Very nice package: [[https://github.com/alphapapa/helm-org-rifle][alphapapa/helm-org-rifle]].
#+BEGIN_SRC emacs-lisp :tangle ./templates/emacs/org.el
(defun cayek:org-rifle-diary ()
  (interactive)
  (helm-org-rifle-files '("~/org/diary.org"))
  )


(defun cayek:org-rifle-archive ()
  (interactive)
  (helm-org-rifle-directories "~/org/archive/")
  )

(defun cayek:org-rifle-bookmark ()
  (interactive)
  (helm-org-rifle-files '("~/mobile-org/bookmarks.org"))
  )

;; search
(global-set-key (kbd "<f6>") 'cayek:org-rifle-diary)
(global-set-key (kbd "<f5>") 'helm-org-rifle-agenda-files)
(global-set-key (kbd "<f7>") 'cayek:org-rifle-bookmark)
(global-set-key (kbd "<f8>") 'cayek:org-rifle-archive)
#+END_SRC

#+RESULTS:
: cayek:org-rifle-archive

** org projectile
#+BEGIN_SRC emacs-lisp :tangle ./templates/emacs/org.el
(defvar cayek:topo_proj_template "
:PROPERTIES:
:CREATED:  %U
:EFFORT:   1d
:INCHARGE: cayek
:END:

,*Objectives:*

,*Actions:*

,*Blocking points:*

,*Remarks:*

")

;; org projectile
(require 'org-projectile)

(setq org-projectile-projects-file "~/org/projects.org")
(org-projectile-single-file)
(setq  org-projectile-capture-template
       (format "%s%s" "* TODO %?" cayek:topo_proj_template))
(global-set-key (kbd "C-c n p") 'org-projectile-capture-for-current-project)

;; Outgoing email (msmtp + msmtpq)
(setq send-mail-function 'sendmail-send-it
      sendmail-program "/usr/bin/msmtp"
      mail-specify-envelope-from t
      message-sendmail-envelope-from 'header
      mail-envelope-from 'header)
#+END_SRC
* zsh
*Feature*
- oh my zsh
** ansible
#+BEGIN_SRC yaml :tangle tasks/zsh.yml 
- name: install zsh
  apt:
    name: ['zsh']
    state: latest
    install_recommends: yes
    update_cache: yes
  become: yes

- name: Clone oh my zsh
  git:
    repo: "https://github.com/robbyrussell/oh-my-zsh.git"
    dest: "/home/{{username}}/.oh-my-zsh"

- name: zshrc
  template:
    src: zsh/.zshrc
    dest: '/home/{{username}}/.zshrc'
    force: no
#+END_SRC
** Template
#+BEGIN_SRC shell :tangle templates/zsh/.zshrc
export ZSH="/home/cayek/.oh-my-zsh"

ZSH_THEME="agnoster"

plugins=(git)

source $ZSH/oh-my-zsh.sh

## alias
alias rm=rm -i
alias cp=cp -i
alias cp=cp -i
#+END_SRC
* tmux
*Features*
- oh my tmux
** ansible
#+BEGIN_SRC yaml :tangle tasks/tmux.yml 
- name: install tmux
  apt:
    name: ['tmux']
    state: latest
    install_recommends: yes
    update_cache: yes
  become: yes

- name: Clone oh my tmux
  git:
    repo: "https://github.com/gpakosz/.tmux.git"
    dest: "/home/{{username}}/.tmux/"

- name: link oh my tmux
  file:
    src: "/home/{{username}}/.tmux/.tmux.conf"
    dest: "/home/{{username}}/.tmux.conf"
    state: link

- name: add zsh tmux plugin
  lineinfile: 
    dest: "/home/{{username}}/.zshrc"
    state: present
    regexp: 'plugins=\(((?!.*?(tmux)).*)\)$'
    line: plugins=(\1 tmux)
    backrefs: yes
  when: (zsh_enabled | default(False))

- name: tmux force auto start with zsh
  lineinfile: 
    dest: "/home/{{username}}/.zshrc"
    insertbefore: BOF
    line: ZSH_TMUX_AUTOSTART=true
  when: (tmux_autostart | default(False))

- name: tmux avoid autoquit
  lineinfile: 
    dest: "/home/{{username}}/.zshrc"
    insertbefore: BOF
    line: ZSH_TMUX_AUTOQUIT=false
  when: (tmux_autostart | default(False))
#+END_SRC
* mail
** ansible
#+BEGIN_SRC yaml :tangle tasks/mail.yml 
- name: install mail packages
  apt:
    name: ['notmuch', 'isync', 'python-notmuch', 'msmtp']
    state: present
    install_recommends: yes
    update_cache: yes
  become: yes


- name: emacs mail.el
  template:
    src: emacs/mail.el
    dest: "{{spacemacs_dotdirectory}}/userconf/mail.el"

- name: notmuch config
  template:
    src: mail/.notmuch-config
    dest: "/home/{{username}}/.notmuch-config"
    force: no
    mode: 0600

- name: mbsync conf
  template:
    src: mail/.msmtprc
    dest: '/home/{{username}}/.msmtprc'
    force: no
    mode: 0600

- name: isync conf
  template:
    src: mail/.mbsyncrc
    dest: '/home/{{username}}/.mbsyncrc'
    force: no
    mode: 0600

- name: create afew dir
  file:
    path: '/home/{{username}}/.config/afew/'
    state: directory

- name: afew conf
  template:
    src: mail/afew
    dest: '/home/{{username}}/.config/afew/config'
    force: no
    mode: 0600

- name: create afew dir for notmuch hook
  file:
    path: '/home/{{username}}/mail/.notmuch/hooks/'
    state: directory

- name: afew hook 
  template:
    src: mail/post-new
    dest: '/home/{{username}}/mail/.notmuch/hooks/post-new'
    force: no
    mode: 0700

- name: create mail dir
  file:
    path: '/home/{{username}}/mail/{{mail_account}}/'
    state: directory

- name: script to fetch mail
  template:
    src: mail/mail.sh
    dest: '/home/{{username}}/.bin/mail.sh'
    force: yes
    mode: 0700

- name: create systemd dir
  file:
    path: '/home/{{username}}/.config/systemd/user/'
    state: directory

- name: create systemd mail service timer
  template:
    src: mail/mail.timer
    dest: '/home/{{username}}/.config/systemd/user/mail.timer'
    force: yes
    mode: 0600

- name: create systemd mail service
  template:
    src: mail/mail.service
    dest: '/home/{{username}}/.config/systemd/user/mail.service'
    force: yes
    mode: 0600

- name: start mail.timer
  systemd:
    daemon_reload: yes
    state: started
    name: mail.timer
    user: yes
#+END_SRC
** templates
*** emacs
#+BEGIN_SRC emacs-lisp :tangle ./templates/emacs/mail.el
;; Outgoing email (msmtp + msmtpq)
(setq send-mail-function 'sendmail-send-it
      sendmail-program "/usr/bin/msmtp"
      mail-specify-envelope-from t
      message-sendmail-envelope-from 'header
      mail-envelope-from 'header)
#+END_SRC

**** TODO Send html mail with orgmode
I use the  [[https://github.com/org-mime/org-mime][org-mime]] packages: 

#+NAME: elisp_org_sendmail
#+BEGIN_SRC emacs-lisp
(require 'org-mime)

(setq org-mime-export-options '(:section-numbers nil
                                                 :with-author nil
                                                 :with-toc nil))
#+END_SRC

*** notmuch
#+BEGIN_SRC text :tangle templates/mail/.notmuch-config
# .notmuch-config - Configuration file for the notmuch mail system
#
# For more information about notmuch, see https://notmuchmail.org

# Database configuration
#
# The only value supported here is 'path' which should be the top-level
# directory where your mail currently exists and to where mail will be
# delivered in the future. Files should be individual email messages.
# Notmuch will store its database within a sub-directory of the path
# configured here named ".notmuch".
#
[database]
path=/home/{{username}}/mail

# User configuration
#
# Here is where you can let notmuch know how you would like to be
# addressed. Valid settings are
#
#	name		Your full name.
#	primary_email	Your primary email address.
#	other_email	A list (separated by ';') of other email addresses
#			at which you receive email.
#
# Notmuch will use the various email addresses configured here when
# formatting replies. It will avoid including your own addresses in the
# recipient list of replies, and will set the From address based on the
# address to which the original email was addressed.
#
[user]
name={{name}}
primary_email={{primary_email}}
other_email={{other_email}}

# Configuration for "notmuch new"
#
# The following options are supported here:
#
#	tags	A list (separated by ';') of the tags that will be
#		added to all messages incorporated by "notmuch new".
#
#	ignore	A list (separated by ';') of file and directory names
#		that will not be searched for messages by "notmuch new".
#
#		NOTE: *Every* file/directory that goes by one of those
#		names will be ignored, independent of its depth/location
#		in the mail store.
#
[new]
tags=new
ignore=

# Search configuration
#
# The following option is supported here:
#
#	exclude_tags
#		A ;-separated list of tags that will be excluded from
#		search results by default.  Using an excluded tag in a
#		query will override that exclusion.
#
[search]
exclude_tags=deleted;spam;

# Maildir compatibility configuration
#
# The following option is supported here:
#
#	synchronize_flags      Valid values are true and false.
#
#	If true, then the following maildir flags (in message filenames)
#	will be synchronized with the corresponding notmuch tags:
#
#		Flag	Tag
#		----	-------
#		D	draft
#		F	flagged
#		P	passed
#		R	replied
#		S	unread (added when 'S' flag is not present)
#
#	The "notmuch new" command will notice flag changes in filenames
#	and update tags, while the "notmuch tag" and "notmuch restore"
#	commands will notice tag changes and update flags in filenames
#
[maildir]
synchronize_flags=true

#+END_SRC
*** msmtp
#+BEGIN_SRC text :tangle ./templates/mail/.msmtprc
# Set default values for all following accounts.
defaults
auth           on
tls            on
tls_trust_file /etc/ssl/certs/ca-certificates.crt
logfile        ~/.msmtp.log

account {{mail_account}}
host {{smtp_host}}
from {{primary_email}}
user {{smtp_user}}
protocol smtp
auth login
port {{smtp_port}}
password {{smtp_pass}}

# Set a default account
account default : {{mail_account}}
#+END_SRC
*** isync
#+BEGIN_SRC text :tangle ./templates/mail/.mbsyncrc
## mail perso
IMAPAccount {{mail_account}}
# Address to connect to
Host {{smtp_host}}
User {{smtp_user}}
Pass {{imap_pass}}
SSLType IMAPS
# The following line should work. If get certificate errors, uncomment the two following lines and read the "Troubleshooting" section.
CertificateFile /etc/ssl/certs/ca-certificates.crt
Timeout 120

IMAPStore {{mail_account}}-remote
Account {{mail_account}}

MaildirStore {{mail_account}}-local
Subfolders Verbatim
# The trailing "/" is important
Path ~/mail/{{mail_account}}/
Inbox ~/mail/{{mail_account}}/Inbox

Channel {{mail_account}}
Master :{{mail_account}}-remote:
Slave :{{mail_account}}-local:
Patterns * 
# Automatically create missing mailboxes, both locally and on the server
Create Both
# Save the synchronization state files in the relevant directory
SyncState *

#+END_SRC
*** script
#+BEGIN_SRC shell :tangle ./templates/mail/mail.sh
#!/usr/bin/env bash

me=`whoami`
NEW_MAIL=false
mbsync -Va
if ! ( notmuch new | grep "No new mail."); then
    NEW_MAIL=true
fi

if [ $NEW_MAIL = true ]; then
    if grep -qE "(Microsoft|WSL)" /proc/version &> /dev/null ; then
        /home/$me/.bin/windows-notify.sh "New mail."
    else
        notify-send "New mail"
    fi
fi

#+END_SRC
*** afew
#+BEGIN_SRC toml :tangle ./templates/mail/afew
# This is the default filter chain
[SpamFilter]
[KillThreadsFilter]
[ListMailsFilter]
[ArchiveSentMailsFilter]
[InboxFilter]
#+END_SRC

#+BEGIN_SRC shell :tangle ./templates/mail/post-new
#!/bin/sh
$HOME/.pyvenv/bin/afew --tag --new
#+END_SRC
*** systemd
#+BEGIN_SRC systemd :tangle ./templates/mail/mail.timer
[Unit]
Description=Mail sync

[Timer]
OnBootSec=2m
OnUnitActiveSec=5m
Unit=mail.service

[Install]
WantedBy=timers.target
#+END_SRC

#+BEGIN_SRC systemd :tangle ./templates/mail/mail.service
[Unit]
Description=Fetch mail

[Service]
Type=oneshot
ExecStart=/home/{{username}}/.bin/mail.sh
#+END_SRC
* calendar
*Features*
- calendar sync with [[https://github.com/pimutils/vdirsyncer][pimutils/vdirsyncer]] and convert them to orgmode with
  [[https://github.com/asoroa/ical2org.py][asoroa/ical2org.py]]
- 
* nextcloud
:LOGBOOK:
- Note taken on [2019-07-29 lun. 15:41] \\
  use webdav for all my host: seel [[https://docs.nextcloud.com/server/13/user_manual/files/access_webdav.html#creating-webdav-mounts-on-the-linux-command-line][Creating WebDAV mounts on the Linux command
  line]].
:END:

#+BEGIN_SRC yaml :tangle tasks/nextcloud.yml 
  ---
  - name: add emacs repo
    apt_repository:
      repo: "ppa:nextcloud-devs/client"
      state: present
    become: yes

  - name: install nextcloudcmd
    apt:
      name: ["nextcloud-client"]
      state: latest
      install_recommends: yes
      update_cache: yes
    become: yes

#+END_SRC
* python
:LOGBOOK:
- Note taken on [2019-07-26 ven. 14:46] \\
  TODO: install python 3.6 with pyenv and set as default + install jupyter jedi and ipython
:END:
*features*
- relp in emacs with [[https://github.com/kaz-yos/eval-in-repl][eval-in-repl]]
- jupyter integration in emacs with [[https://github.com/dzop/emacs-jupyter][dzop/emacs-jupyter]]
** ansible
:LOGBOOK:
- Note taken on [2019-07-26 ven. 14:32] \\
  TODO Install conda: [[https://docs.anaconda.com/anaconda/install/silent-mode/#linux-macos][Installing in silent mode]]
:END:
*** Python core 
#+BEGIN_SRC yaml :tangle tasks/python.yml :mkdirp yes
- name: install python core packages
  apt:
    name: [python, python-virtualenv, python-dev, python-setuptools, python-pip, python3, python3-setuptools, python3-dev, python3-pip]
    state: present
    install_recommends: yes
    update_cache: yes
  become: yes
#+END_SRC
