templates/emacs/org.el

(defun cayek:open_proj_inbox ()
  (interactive)
  (find-file-existing "~/org/INBOX.org")
  )

(defun cayek:open_cce()
  (interactive)
  (find-file-existing "~/projects/sysadmin/cce/cce.org")
  )

(defun cayek:open_diary()
  (interactive)
  (find-file-existing "~/org/diary.org")
  )

;; org files
(global-set-key (kbd "<f1>") 'cayek:open_proj_inbox)
(global-set-key (kbd "<f2>") 'cayek:open_diary)
(global-set-key (kbd "<f3>") 'cayek:open_cce)

(with-eval-after-load 'org
  (org-babel-do-load-languages
   'org-babel-load-languages
   '(
     (shell . t)
     (python . t)
     (R . t)
     (dot . t)
     (org . t)
     (makefile . t)
     (emacs-lisp . t)
     (http . t)
     (jupyter . t)
     ))
  )

(defun cayek:org-rifle-diary ()
  (interactive)
  (helm-org-rifle-files '("~/org/diary.org"))
  )

(defun cayek:org-rifle-archive ()
  (interactive)
  (helm-org-rifle-directories "~/org/archive/")
  )

(defun cayek:org-rifle-bookmark ()
  (interactive)
  (helm-org-rifle-files '("~/mobile-org/bookmarks.org"))
  )

;; search
(global-set-key (kbd "<f5>") 'cayek:org-rifle-diary)
(global-set-key (kbd "<f6>") 'helm-org-rifle-agenda-files)
(global-set-key (kbd "<f7>") 'cayek:org-rifle-bookmark)
(global-set-key (kbd "<f8>") 'cayek:org-rifle-archive)

(defvar cayek:topo_proj_template "
:PROPERTIES:
:CREATED:  %U
:EFFORT:   1d
:INCHARGE: cayek
:END:

*Objectives:*

*Actions:*

*Blocking points:*

*Remarks:*

")

;; org projectile
(require 'org-projectile)

(setq org-projectile-projects-file "~/org/projects.org")
(org-projectile-single-file)
(setq  org-projectile-capture-template
       (format "%s%s" "* TODO %?" cayek:topo_proj_template))
(global-set-key (kbd "C-c n p") 'org-projectile-capture-for-current-project)

;; Outgoing email (msmtp + msmtpq)
(setq send-mail-function 'sendmail-send-it
      sendmail-program "/usr/bin/msmtp"
      mail-specify-envelope-from t
      message-sendmail-envelope-from 'header
      mail-envelope-from 'header)
