cce.org
*** Conda
#+BEGIN_SRC yaml :tangle tasks/python.yml :mkdirp yes
- name: Check if conda is installed
  stat: path=/home/{{username}}/miniconda3/
  register: miniconda_path

- name: get miniconda install script
  get_url:
    url: https://repo.anaconda.com/miniconda/Miniconda3-latest-Linux-x86_64.sh
    dest: /tmp/miniconda.sh
  when: miniconda_path.stat.exists == false

- name: Install miniconda
  shell: bash /tmp/miniconda.sh -b -p /home/{{username}}/miniconda3
  when: miniconda_path.stat.exists == false
#+END_SRC
*** Pyenv
#+BEGIN_SRC yaml :tangle tasks/python.yml :mkdirp yes
# see https://github.com/pyenv/pyenv/wiki/Common-build-problems#prerequisites
- name: packages for pyenv
  apt:
    name: ['make', 'build-essential', 'libssl-dev', 'zlib1g-dev', 'libbz2-dev', 'libreadline-dev', 'libsqlite3-dev', 'wget', 'curl', 'llvm', 'libncurses5-dev', 'libncursesw5-dev', 'xz-utils', 'tk-dev', 'libffi-dev', 'liblzma-dev', 'python-openssl', 'git']
    state: present
    install_recommends: yes
    update_cache: yes
  become: yes

- name: Clone pyenv
  git:
    repo: "https://github.com/pyenv/pyenv.git"
    dest: ~/.pyenv/

- name: Clone pyenv virtualenv
  git:
    repo: "https://github.com/pyenv/pyenv-virtualenv.git"
    dest: ~/.pyenv/plugins/pyenv-virtualenv/
#+END_SRC
*** Virtualenv
#+BEGIN_SRC yaml :tangle tasks/python.yml :mkdirp yes
- name: Install virtualenv and virtualenvvrapper in .pyvenv
  pip: 
    virtualenv_python: python3.6
    virtualenv: "{{pyvenv_path}}"
    virtualenv_site_packages: yes
    name: ['virtualenv', 'virtualenvwrapper']
    state: latest

- name: Create symlink for virtualenv
  file: 
    src: '{{pyvenv_path}}/bin/{{ item }}'
    dest: '{{extra_bin_path}}/{{ item }}'
    state: link
  with_items:
    - virtualenv
    - virtualenv-clone

#+END_SRC
*** pyls and others utils
#+BEGIN_SRC yaml :tangle tasks/python.yml :mkdirp yes
- name: Install virtualenv and virtualenvvrapper in .pyvenv
  pip: 
    virtualenv_python: python3.6
    virtualenv: "{{pyvenv_path}}"
    virtualenv_site_packages: yes
    name: ['python-language-server[all]']
    state: latest


- name: Create symlink for pyls and other tools
  file: 
    src: '{{pyvenv_path}}/bin/{{ item }}'
    dest: '{{extra_bin_path}}/{{ item }}'
    state: link
  with_items:
    - flake8
    - pyls
#+END_SRC
*** Setup shell
#+BEGIN_SRC yaml :tangle tasks/python.yml :mkdirp yes
- name: add bash pyenv init
  blockinfile: 
    dest: "/home/{{username}}/.bash_profile"
    create: yes
    insertafter: EOF
    block: |
      export PYENV_ROOT="$HOME/.pyenv"
      export PATH="$PYENV_ROOT/bin:/home/{{username}}/.bin:$PATH"
      # pyenv
      eval "$(pyenv init -)"
      eval "$(pyenv virtualenv-init -)"
      # virtualenv
      export WORKON_HOME=$HOME/.virtualenvs
      export VIRTUALENVWRAPPER_PYTHON=/home/{{username}}/.pyvenv/bin/python
      export PROJECT_HOME=$HOME/projects
      source /home/{{username}}/.pyvenv/bin/virtualenvwrapper.sh
  tags: that

- name: add zsh pyenv init
  blockinfile: 
    dest: "/home/{{username}}/.zshenv"
    create: yes
    insertafter: EOF
    block: |
      export PYENV_ROOT="$HOME/.pyenv"
      export PATH="$PYENV_ROOT/bin:/home/{{username}}/.bin:$PATH"
      # pyenv
      eval "$(pyenv init -)"
      eval "$(pyenv virtualenv-init -)"
      # virtualenv
      export WORKON_HOME=$HOME/.virtualenvs
      export VIRTUALENVWRAPPER_PYTHON=/home/{{username}}/.pyvenv/bin/python
      export PROJECT_HOME=$HOME/projects
      source /home/{{username}}/.pyvenv/bin/virtualenvwrapper.sh
  when: (zsh_enabled | default(False))
  tags: that
#+END_SRC
*** Emacs
#+BEGIN_SRC yaml :tangle tasks/python.yml :mkdirp yes
- name: spacemacs python.el 
  template:
    src: emacs/python.el
    dest: "{{spacemacs_dotdirectory}}/userconf/python.el"
#+END_SRC
** emacs
#+BEGIN_SRC emacs-lisp :tangle ./templates/emacs/python.el
(require 'python)

;; to see env with pyvenv: https://emacs.stackexchange.com/questions/20092/using-conda-environments-in-emacs
(setenv "WORKON_HOME" "/home/{{username}}/.virtualenvs/")

(require 'eval-in-repl-python)
(setq eir-repl-placement 'below)
(setq eir-always-split-script-window t)
(add-hook 'python-mode-hook
          '(lambda ()
             (local-set-key (kbd "<C-return>") 'eir-eval-in-python)))
#+END_SRC
* R
*Features*
- install R
- install R main packages for user
** ansible
#+BEGIN_SRC yaml :tangle tasks/r.yml
- name: apt key for R
  apt_key:
    keyserver: keyserver.ubuntu.com
    id: E084DAB9
  become: yes

- name: apt repo for R
  apt_repository:
    repo: deb https://cloud.r-project.org/bin/linux/ubuntu bionic-cran35/
    state: present
  become: yes

- name: install R packages
  apt:
    name: ['r-base', 'r-recommended', 'r-base-core']
    state: latest
    install_recommends: yes
    update_cache: yes
  become: yes

- name: install deps for R pacakges
  apt:
    name: ['libssl-dev', 'libcurl4-openssl-dev', 'libxml2-dev']
    state: present
    install_recommends: yes
    update_cache: yes
  become: yes

- name: create local R library folder
  file:
    path: "/home/{{username}}/R/x86_64-pc-linux-gnu-library/3.6/"
    state: directory
    recurse: yes

- name: Clone cayekR my R utils package
  git:
    repo: git@github.com:cayek/cayekR.git
    dest: '/home/{{username}}/projects/opensource/cayekR'
    accept_hostkey: yes

- name: install a few R packages
  command: /usr/bin/Rscript --slave --no-save --no-restore-history /home/{{username}}/projects/opensource/cayekR/R/install.R
#+END_SRC
* Bibliotheque
*features*
- Reference management in emacs with [[https://github.com/jkitchin/org-ref][jkitchin/org-ref]]
- document anotator with [[https://github.com/weirdNox/org-noter][weirdNox/org-noter]]
** ansible

#+BEGIN_SRC yaml :tangle tasks/bib.yml
- name: emacs bib.el
  template:
    src: emacs/bib.el
    dest: "{{spacemacs_dotdirectory}}/userconf/bib.el"
#+END_SRC

** emacs
#+BEGIN_SRC emacs-lisp :tangle templates/emacs/bib.el
(require 'org-ref)

(setq org-ref-default-bibliography '("~/bibliotheque/bibliotheque.bib")
      org-ref-pdf-directory "~/bibliotheque/"
      org-ref-bibliography-notes "~/bibliotheque/bibliotheque.org")
#+END_SRC

#+RESULTS:
: ~/bibliotheque/bibliotheque.org

* docker
#+BEGIN_SRC yaml :tangle tasks/docker.yml
---
- name: install python3-pip
  apt:
    name: python3-pip
    state: present
  register: result
  until: result is succeeded
  become: yes

- name: 'Install docker-py'
  pip:
    name: docker-py
    state: present
  register: result
  until: result is succeeded

- name: create docker home
  file:
    path: "{{ docker_home }}"
    mode: 0755
    state: directory
  become: yes

- name: add user account to docker group
  user:
    name: "{{ username }}"
    group: docker
    append: yes
  become: yes

- name: update docker home from install default
  template:
    src: docker/daemon.json
    dest: /etc/docker/daemon.json
  register: docker_config
  become: yes

- name: restart docker
  service:
     name: docker
     state: restarted
  when: docker_config.changed
  become: yes
  tags:
    - skip_ansible_lint
#+END_SRC

#+BEGIN_SRC json :tangle templates/docker/daemon.json
{
  "data-root": "{{ docker_image_directory }}",
  "storage-driver": "{{ docker_storage_driver }}"
}
#+END_SRC

* Natural language 
All you need to write in natural language.
*Features*
- latex, pandox etc
- TODO grammar checker
- hugo for blogging
- learn new language with [[https://apps.ankiweb.net/][anki]]
- write orgmode anki card with [[https://github.com/louietan/anki-editor][louietan/anki-editor]]
** ansible

#+BEGIN_SRC yaml :tangle tasks/write.yml
- name: install tool to compile natural language
  apt:
    name: ['texlive-full', 'pandoc', 'context', 'hugo']
    state: latest
    install_recommends: yes
    update_cache: yes
  become: yes

- name: install learn new language
  apt:
    name: ['anki']
    state: latest
    install_recommends: yes
    update_cache: yes
  become: yes
#+END_SRC

* Some Inspiring Projects
#+BEGIN_SRC yaml :tangle tasks/inspiration.yml
- name: Create src dir
  file:
    path: '/home/{{username}}/.src/'
    state: directory
  become_user: "{{username}}"

- name: Clone afew
  git: repo=https://github.com/afewmail/afew.git
       dest=~/.src/afew
       accept_hostkey=yes
  become_user: "{{username}}"

- name: Clone org-html-themes
  git: repo=https://github.com/fniessen/org-html-themes.git
       dest=~/.src/org-html-themes
       accept_hostkey=yes
  become_user: "{{username}}"

- name: Clone worgle
  git: repo=https://github.com/OrgTangle/Worgle.git
       dest=~/.src/Worgle
       accept_hostkey=yes
  become_user: "{{username}}"
 
- name: Fetch ansible nas
  git:
    repo: https://github.com/davestephens/ansible-nas.git
    dest: /home/{{username}}/.src/ansible-nas
  become_user: "{{username}}"

- name: Fetch ansible reveal.js
  git:
    repo: https://github.com/hakimel/reveal.js.git
    dest: /home/{{username}}/.src/reveal.js
  become_user: "{{username}}"

- name: Clone grasp
  git:
    repo: https://github.com/karlicoss/grasp.git
    dest: /home/{{username}}/.src/grasp
  become_user: "{{username}}"

- name: Clone doit
  git:
    repo: https://github.com/pydoit/doit.git
    dest: /home/{{username}}/.src/doit
  become_user: "{{username}}"

- name: doit zsh tab completion
  copy:
    src: /home/{{username}}/.src/doit/zsh_completion_doit
    dest: "{{extra_zshcompletion_path}}/_doit"
    mode: '0644'
  become_user: "{{username}}"
  when: (zsh_enabled | default(False))

- name: Clone fastai
  git:
    repo: https://github.com/fastai/fastai.git
    dest: /home/{{username}}/.src/fastai
  become_user: "{{username}}"

- name: Clone seaborn
  git:
    repo: https://github.com/mwaskom/seaborn.git
    dest: /home/{{username}}/.src/seaborn
  become_user: "{{username}}"

- name: Clone xgboost
  git:
    repo: https://github.com/dmlc/xgboost.git
    dest: /home/{{username}}/.src/xgboost
  become_user: "{{username}}"
#+END_SRC
* Work with remote server
** Tramp and git-gutter bug
Following [[https://github.com/nonsequitur/git-gutter-plus/issues/42#issuecomment-464463744][this answer]]
#+BEGIN_SRC emacs-lisp :tangle ./templates/emacs/tramp.el
(with-eval-after-load 'git-gutter+
   (defun git-gutter+-remote-default-directory (dir file)
     (let* ((vec (tramp-dissect-file-name file))
            (method (tramp-file-name-method vec))
            (user (tramp-file-name-user vec))
            (domain (tramp-file-name-domain vec))
            (host (tramp-file-name-host vec))
            (port (tramp-file-name-port vec)))
       (tramp-make-tramp-file-name method user domain host port dir)))

   (defun git-gutter+-remote-file-path (dir file)
     (let ((file (tramp-file-name-localname (tramp-dissect-file-name file))))
       (replace-regexp-in-string (concat "\\`" dir) "" file))))
#+END_SRC

#+BEGIN_SRC yaml :tangle tasks/remote.yml
- name: tramp.el 
  template:
    src: emacs/tramp.el
    dest: "{{spacemacs_dotdirectory}}/userconf/tramp.el"

#+END_SRC
